Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиРаспознавания/ПС_НастройкиРаспознавания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_НастройкиРаспознавания</name>
  <predefined>
    <items>
      <name>АдресСервисаРаспознаванияДокументов</name>
      <description>Адрес сервиса распознавания документов</description>
    </items>
    <items>
      <name>ЛогинN8N</name>
      <description>Логин сервиса</description>
    </items>
    <items>
      <name>ПарольN8N</name>
      <description>Пароль сервиса</description>
    </items>
    <items>
      <name>ОсновнаяЛицензия</name>
      <description>Основная лицензия</description>
    </items>
    <items>
      <name>РезервнаяЛицензия</name>
      <description>Резервная лицензия</description>
    </items>
    <items>
      <name>ИспользоватьКомпонентуОкантовки</name>
      <description>Использовать компоненту окантовки</description>
    </items>
    <items>
      <name>ПорогТочностиДляДополнительногоПоискаИИ</name>
      <description>Порог точности для дополнительного поиска ИИ</description>
    </items>
    <items>
      <name>ПорогТочностиДляПрикрепленияДокументов</name>
      <description>Порог точности для прикрепления документов</description>
    </items>
    <items>
      <name>ГлубинаИИПоискаМес</name>
      <description>Глубина ИИ поиска (мес)</description>
    </items>
    <items>
      <name>КоличествоСтрокДляПоискаДокументаИИ</name>
      <description>Количество строк для поиска документа ИИ</description>
    </items>
    <items>
      <name>КоличествоПопытокАвтоматическогоРаспознавания</name>
      <description>Количество попыток автоматического распознавания</description>
    </items>
    <items>
      <name>ИнтервалАвтоматическойОбработкиМин</name>
      <description>Интервал автоматической обработки мин</description>
    </items>
    <items>
      <name>ОткрыватьСканированиеПриНачалеРаботы</name>
      <description>Открывать сканирование при начале работы</description>
    </items>
    <items>
      <name>СоздаватьКонтрагентовАвтоматическиПриЗагрузке</name>
      <description>Создавать контрагентов автоматически при загрузке</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиРаспознавания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает значение параметра распознавания
//
// Параметры:
//  ИмяПараметра - Строка - Имя параметра распознавания
//
// Возвращаемое значение:
//  Строка - Значение параметра распознавания
Функция ПараметрРаспознавания(ИмяПараметра) Экспорт
	
		ЭлементНастроек = Справочники.ПС_НастройкиРаспознавания[ИмяПараметра];
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПС_НастройкиРаспознавания.Ссылка,
		               |	ПС_НастройкиРаспознавания.Пароль,
		               |	ПС_НастройкиРаспознавания.Значение
		               |ИЗ
		               |	Справочник.ПС_НастройкиРаспознавания КАК ПС_НастройкиРаспознавания
		               |ГДЕ
		               |	ПС_НастройкиРаспознавания.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементНастроек);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЭлементНастроек = Выборка;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементНастроек.Пароль) Тогда
			
			Возврат ЭлементНастроек.Пароль;
			
		ИначеЕсли ЗначениеЗаполнено(ЭлементНастроек.Значение) Тогда
			
			Возврат ЭлементНастроек.Значение;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецФункции

#КонецОбласти

//#Область ОбработчикиСобытий
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

#КонецЕсли
